tct-service/data-xml-base/template-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gip="http://gip.request.com/">
    <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken wsu:Id="UsernameToken-03E2233506C74814A6164664150714529"><wsse:Username>LIENVIETPOSTBANK</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">FJY/ljGFhMINtyz+gVzYJ9UjZxo=</wsse:Password><wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">4KjVnoG9ZQFCnvVVHw+3jA==</wsse:Nonce><wsu:Created>2022-03-07T08:25:07.145Z</wsu:Created></wsse:UsernameToken></wsse:Security></soapenv:Header>
    <soapenv:Body>
        <gip:xuLyTruyVanMsg>
            <in_msg><![CDATA[%s]]></in_msg>
        </gip:xuLyTruyVanMsg>
    </soapenv:Body>
</soapenv:Envelope>
